#### Import արեք pandas գրադարանը pd  անունով

In [43]:
# TODO
import pandas as pd
import numpy as np

### Import the dataset baby_names.csv, assign it to a variable called baby_names

### Import արեք baby_names.txt dataset-ը ու այն վերագրեք baby_names փոփոխականի

In [44]:
# TODO
df_baby = pd.read_csv("baby_names.csv", index_col=False)
df_baby.head()

   Unnamed: 0     Id     Name  Year Gender State  Count
0       11349  11350     Emma  2004      F    AK     62
1       11350  11351  Madison  2004      F    AK     48
2       11351  11352   Hannah  2004      F    AK     46
3       11352  11353    Grace  2004      F    AK     44
4       11353  11354    Emily  2004      F    AK     41

### See the first 10 entries.

### Տպեք առաջին 10 արժեքը

In [45]:
# TODO
df_baby.head(10)

   Unnamed: 0     Id      Name  Year Gender State  Count
0       11349  11350      Emma  2004      F    AK     62
1       11350  11351   Madison  2004      F    AK     48
2       11351  11352    Hannah  2004      F    AK     46
3       11352  11353     Grace  2004      F    AK     44
4       11353  11354     Emily  2004      F    AK     41
5       11354  11355   Abigail  2004      F    AK     37
6       11355  11356    Olivia  2004      F    AK     33
7       11356  11357  Isabella  2004      F    AK     30
8       11357  11358    Alyssa  2004      F    AK     29
9       11358  11359    Sophia  2004      F    AK     28

### Delete the columns 'Unnamed: 0' and 'Id'

### Ջնջեք 'Unnamed: 0' ու 'Id' սյուները

In [46]:
# TODO
df_baby.pop("Unnamed: 0");
df_baby.pop("Id");

### Are there more male or female names in the dataset?

### Արդյոք dataset-ում ավելի շատ են կանացի թե տղամարդու անունները?

In [47]:
# TODO
# equal
for value in df_baby["Gender"].unique():
    print(f"{value} contains ", (df_baby["Gender"] == value).shape[0])

F contains  2503
M contains  2503

### Delete the column 'Year'. Group the dataset by name and assign to names.

### Ջնջեք 'Year' սյունը. Խմբավորեք dataset-ը ըստ անունի ու վերագրեք արդյունքը names փոփոխականին

In [48]:
df_baby = df_baby.drop(['Year'], axis=1)

In [56]:
# TODO
names = df_baby.groupby(["Name"]).mean()
names.head()

             Count
Name
Aaliyah  10.636364
Aaron    29.000000
Abby      6.000000
Abigail  35.636364
Ada       5.000000

### How many different names exist in the dataset?

### Քանի հատ տարբեր անուն կա dataset-ում?

In [60]:
# TODO
df_baby["Name"].unique()[:10], len(df_baby["Name"].unique())

(array(['Emma', 'Madison', 'Hannah', 'Grace', 'Emily', 'Abigail', 'Olivia',
        'Isabella', 'Alyssa', 'Sophia'], dtype=object),
 575)

### What is the name with most occurrences?

### Որն է ամենաշատ հանդիպող անունը?

In [74]:
# TODO
print(df_baby["Name"].value_counts())
df_baby["Name"].value_counts().index[0]

Riley      12
Emma       11
Mia        11
Maya       11
Madison    11
           ..
Hanna       1
Scarlet     1
Ariella     1
Joanna      1
Trenton     1
Name: Name, Length: 575, dtype: int64

'Riley'

### What is the median name occurrence?

### Որն է անունների հանդիպման մեդիանը՞

In [76]:
# TODO
df_baby["Name"].value_counts().mean()

4.35304347826087

### Get a summary with the mean, min, max, std and quartiles.

### Ստացեք dataset-ի ամփոփում mean, min, max, std ու quartile-ներով

In [ ]:
# TODO